# stow for managing dotfiles
brew 'stow'

# bash utilities
brew 'coreutils'
brew 'moreutils'
brew 'htop'
brew 'distribution'

# Install more recent versions of some OS X tools.
brew 'macvim' --override-system-vim

# web
brew 'node'
brew 'wget'

# tmux
brew 'tmux'
brew 'reattach-to-user-namespace'

# code
brew 'ctags'
brew 'ack'
brew 'the_silver_searcher'
brew 'git'
brew 'git-lfs'

# Install other useful binaries.
brew 'imagemagick --with-webp'
brew 'rename'
brew 'speedtest_cli'
brew 'ssh-copy-id'
brew 'tree'
brew 'fasd'
brew 'fzf'
brew 'terminal-notifier'

# QT graphics library
brew 'qt'

# python
brew 'python3'
brew 'python'

# just for fun
brew 'archey'
brew 'cowsay'

# apps
brew 'caskroom/cask/brew-cask'
cask 'iterm2'
cask 'spotify'
cask 'dropbox'
cask 'slack'
