# stow for managing dotfiles
brew 'stow'
brew 'zsh'

# bash utilities
brew 'coreutils'
brew 'moreutils'
brew 'htop'
brew 'distribution'

# web
brew 'node'
brew 'wget'

# tmux
brew 'tmux'

# code
brew 'neovim/neovim/neovim'
brew 'ctags'
brew 'ack'
brew 'the_silver_searcher'
brew 'git'

# Install other useful binaries.
brew 'imagemagick'
brew 'rename'
brew 'fasd'
brew 'fzf'
brew 'terminal-notifier'

# QT graphics library
brew 'qt'
